Repository: dina200/dia_app
Catalog: lib/src/device/l10n/dia_*.arb
Languages: ru, uk

# tagline
source: your health under control
ru: Ваше здоровье под контролем

# enterWithGoogle
source: Sign in via Google
ru: Войти с помощью Google

# enterWithGoogleAsDoctor
source: Sign in via Google as doctor
ru: Войти с помощью Google как доктор

source: or
ru: или

# enterWithApple
source: Sign in via Apple
ru: Войти с помощью Apple

# dontHaveAccount
source: Don't have an account?
ru: Нет учетной записи?

# signUpVerb
source: Sign up
ru: Зарегистрироваться

# enterSugarInBloodMeasure
source: Please, enter the data of blood sugar (mmol/L)
ru: Пожалуйста, введите данные сахара в крови (ммоль/л)
uk: Будь ласка, додайте показник рівня цукру в крові (ммоль/л)

# bloodSugarDataExample
source: The example: 4.5
ru: Пример: 4.5
uk: Приклад: 4.5

# errorInputData
source: Please, input data...
ru: Пожалуйста, введите данные
uk: Будь ласка, введіть дані ...

# errorExampleOfInput
source: Example of input format: "4.5"
ru: Пример формата ввода: "4.5"
uk: Приклад формату введення: "4.5"

# errorInvalidDataOfBloodSugar
source: 0.0 < value < 70.0
ru: 0.0 < значение < 70.0
uk: 0.0 < значення < 70.0

# sendNewData
source: Send the blood sugar data
ru: Отправить измерения сахара в крови
uk: Надішліть вимірювання цукру в крові

source: Show diagnosis
ru: Показать диагноз
uk: Показати діагноз

source: User
ru: Пользователь
uk: Користувач

source: Diagnostics
ru: Диагностика
uk: Діагностика

source: Statistics
ru: Статистика
uk: Статистика

# mmolPerL
source: mmol/L
ru: ммоль/л
uk: ммоль/л

source: Hypoglycemia
ru: Гипогликемия
uk: Гіпоглікемія

source: Hyperglycemia
ru: Гипергликемия
uk: Гіперглікемія

source: Normal
ru: Норма
uk: Норма

# dataNotSaved
source: The data isn't saved
ru: Данные не сохранены
uk: Дані не збережено

# dataSaved
source: The data saved
ru: Данные сохранены
uk: Дані збережено

# userName
source: User's name
ru: Имя пользователя
uk: Ім'я користувача

# doctorName
source: Doctor's name
ru: Имя врача

# userNameExample
source: The example: Ivan Ivanov
ru: Пример: Иван Иванов
uk: Іван Іванов

# docEmail
source: Doc's e-mail
ru: Электронная почта доктора
uk: Електронна пошта доктора

# docEmailExample
source: The example: doc@mail.com
ru: Пример: doc@mail.com
uk: Приклад: doc@mail.com

source: Invalid e-mail format
ru: Неверный формат электронной почты
uk: Невірний формат електронної пошти

source: Save
ru: Сохранить
uk: Зберегти

source: Change user
ru: Сменить пользователя
uk: Змінити користувача

source: Today
ru: Сегодня
uk: Сьогодні

source: Last 7 days
ru: Последние 7 дней
uk: Останні 7 днів

source: Last 30 days
ru: Последние 30 дней
uk: Останні 30 днів

source: Year
ru: Год
uk: Рік

source: Whole time
ru: Все время
uk: Цілий час

# sendDataToDoc
source: Send the statistic to your doctor
ru: Отправить статистику врачу

# minMaxBloodSugar
source: Min: {min}, Max: {max}
ru: Мин.: {min}, Макс.: {max}

# diagnosisData
source: Your average blood sugar indicator {averageBloodSugar} mmol/L.
ru: Ваш средний показатель сахара в крови {averageBloodSugar} ммоль/л.

# referenceInfoAboutBloodSugar
source: The norm is from 4.1 to 5.9.
ru: Норма от 4,1 до 5,9.

# bloodSugarStatistic
source: The patient's blood sugar statistic
ru: Статистика уровня сахара в крови пациента

# noData
source: There is no data yet
ru: Данных пока нет

# actionWithUserId
source: Send the id to your doctor:
ru: Отправьте этот id своему врачу:

source: Send id
ru: Отправить id

# sendIdText
source: My id for DIA APP:
ru: Мой идентификатор для DIA APP:

source: Patients
ru: Пациенты

source: Doctor
ru: Доктор

source: Enter patient id
ru: Введите id пациента

source: Add patient
ru: Добавить пациента

# connectGlucometer
source: Press to connect a glucometer to application
ru: Нажмите, чтобы подключить глюкометр к приложению

# searchGlucometer
source: Search for a glucometer
ru: Поиск глюкометра

# fetchBloodSugar
source: Please, use your glucometer to fetch your blood sugar
ru: Пожалуйста, используйте глюкометр, чтобы определить уровень сахара в крови
